Revit 2027 API
ToggleButtonData Constructor
Overload List
Name | Description
ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
Top
See Also
Reference
ToggleButtonData Class
Autodesk.Revit.UI Namespace